php.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>The Book of Web</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content">
<header>
<h1 class="title">The Book of Web</h1>
</header><br>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-center">

<col  class="org-right">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="./#">◀ MySQL</a></td>
<td class="org-center"><a href="./index.html">Table of contents</a></td>
<td class="org-right"><a href="./#">AJAX ▶</a></td>
</tr>
</tbody>
</table>

<div id="outline-container-org9d01036" class="outline-2">
<h2 id="org9d01036">PHP</h2>
<div class="outline-text-2" id="text-org9d01036">
<p>
This chapter covers:
</p>

<ul class="org-ul">
<li>Printing values to HTML</li>
<li>Variables</li>
<li>Strings and concatenation</li>
<li>Arithmetic operators</li>
<li>Conditional statements (if, elseif, else)</li>
<li>While and for loops</li>
<li>Arrays</li>
<li>Foreach loops</li>
<li>Associative arrays</li>
<li>How to use PHP code to connect to MySQL databases</li>
<li>Generating SQL queries with PHP</li>
<li>Creating new databases with PHP</li>
<li>Using PHP to add tables to your database</li>
<li>Using HTML forms to add new database items</li>
</ul>

<p>
PHP files always end in .php, but they can also contain HTML code
You just need to start with this tag:
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #F92672;">&lt;?php</span>
</pre>
</div>

<p>
&#x2026;and finish with this tag:
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #AE81FF;">?&gt;</span>
</pre>
</div>
</div>

<div id="outline-container-orgce98d1f" class="outline-3">
<h3 id="orgce98d1f">Printing</h3>
<div class="outline-text-3" id="text-orgce98d1f">
<p>
To print something in PHP, use the "echo" function:
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #F92672;">echo</span> <span style="color: #E6DB74;">"Hello, PHP!"</span>;
</pre>
</div>

<p>
To print a newline character, insert an HTML &lt;br&gt;:
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #F92672;">echo</span> <span style="color: #E6DB74;">"Hi,&lt;br&gt;How is it going?"</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org02ef312" class="outline-3">
<h3 id="org02ef312">Variables</h3>
<div class="outline-text-3" id="text-org02ef312">
<p>
To declare a variable, its name must start with a dollar sign ($)
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">age</span> = <span style="color: #AE81FF;">32</span>;
<span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">myName</span> = <span style="color: #E6DB74;">"Matt"</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org39b7366" class="outline-3">
<h3 id="org39b7366">String Concatenation</h3>
<div class="outline-text-3" id="text-org39b7366">
<p>
To print strings and variables, put a dot (.) between them:
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #F92672;">echo</span> <span style="color: #E6DB74;">"My name is "</span> . <span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">myName</span> . <span style="color: #E6DB74;">" and my age is "</span> . <span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">age</span> . <span style="color: #E6DB74;">"&lt;br&gt;"</span>;
</pre>
</div>

<p>
A quick way to insert variables inside your strings is to put them inside double quotes ("). This doesn't work with single quotes, though:
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #F92672;">echo</span> <span style="color: #E6DB74;">"My name is </span><span style="color: #FD971F;">$myName</span><span style="color: #E6DB74;"> and my age is </span><span style="color: #FD971F;">$age</span><span style="color: #E6DB74;">&lt;br&gt;"</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org94bfa76" class="outline-3">
<h3 id="org94bfa76">Arithmetic</h3>
<div class="outline-text-3" id="text-org94bfa76">
<p>
PHP has all the usual arithmetic operators:
</p>


<div class="org-src-container">
<pre class="src src-php"><span style="color: #AE81FF;">2</span> + <span style="color: #AE81FF;">3</span>;
<span style="color: #AE81FF;">3</span> - <span style="color: #AE81FF;">4</span>;
<span style="color: #AE81FF;">3</span> * <span style="color: #AE81FF;">3</span>;
<span style="color: #AE81FF;">44</span> / <span style="color: #AE81FF;">3</span>;
<span style="color: #AE81FF;">23</span> % <span style="color: #AE81FF;">4</span>;
</pre>
</div>

<p>
But it also arithmetic assignment operators. These change the value of a variable in place:
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">x</span> = <span style="color: #AE81FF;">1</span>;

<span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">x</span>++; <span style="color: #75715E;">// </span><span style="color: #75715E;">now x is 2</span>
<span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">x</span> += <span style="color: #AE81FF;">1</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">now x = 3</span>
<span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">x</span> -= <span style="color: #AE81FF;">4</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">now x = -1</span>
<span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">x</span> *= -<span style="color: #AE81FF;">4</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">now x = 4</span>
<span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">x</span> /= <span style="color: #AE81FF;">4</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">now x = 1</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org91cac62" class="outline-3">
<h3 id="org91cac62">Data Types</h3>
<div class="outline-text-3" id="text-org91cac62">
<div class="org-src-container">
<pre class="src src-php"><span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">myName</span> = <span style="color: #E6DB74;">"Matt"</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">string</span>
<span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">myAge</span> = <span style="color: #AE81FF;">32</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">integer</span>
<span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">myHeight</span> = <span style="color: #AE81FF;">186.4</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">double</span>
<span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">isTeacher</span> = <span style="color: #AE81FF;">true</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">bool</span>
<span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">nullVal</span> = <span style="color: #AE81FF;">NULL</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">NULL</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6e53234" class="outline-3">
<h3 id="org6e53234">Conditional Statements</h3>
<div class="outline-text-3" id="text-org6e53234">
<p>
PHP has if, elseif and else statements, they work the same way as almost every other language:
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">food</span> = <span style="color: #E6DB74;">"curry"</span>;

<span style="color: #75715E;">// </span><span style="color: #75715E;">if statement:</span>
<span style="color: #F92672;">if</span> <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">food</span> == <span style="color: #E6DB74;">"pasta"</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
    <span style="color: #F92672;">echo</span> <span style="color: #E6DB74;">"I like pasta"</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">this code is executed if $food is "pasta"</span>
<span style="color: #AE81FF;">}</span>

<span style="color: #75715E;">// </span><span style="color: #75715E;">if and else statements:</span>
<span style="color: #F92672;">if</span> <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">food</span> == <span style="color: #E6DB74;">"pasta"</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
    <span style="color: #F92672;">echo</span> <span style="color: #E6DB74;">"I like pasta"</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">this code is executed if $food is "pasta"</span>
<span style="color: #AE81FF;">}</span> <span style="color: #F92672;">else</span> <span style="color: #AE81FF;">{</span>
    <span style="color: #F92672;">echo</span> <span style="color: #E6DB74;">"I don't like pasta"</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">this code is executed if $food is NOT "pasta"</span>
<span style="color: #AE81FF;">}</span>

<span style="color: #75715E;">// </span><span style="color: #75715E;">if, elseif and else statements:</span>
<span style="color: #F92672;">if</span> <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">food</span> == <span style="color: #E6DB74;">"pasta"</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
    <span style="color: #F92672;">echo</span> <span style="color: #E6DB74;">"I like pasta"</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">this code is executed if $food is "pasta"</span>
<span style="color: #AE81FF;">}</span> <span style="color: #F92672;">elseif</span> <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">food</span> == <span style="color: #E6DB74;">"curry"</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
    <span style="color: #F92672;">echo</span> <span style="color: #E6DB74;">"I like curry"</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">this code is executed if $food is "curry"</span>
<span style="color: #AE81FF;">}</span> <span style="color: #F92672;">else</span> <span style="color: #AE81FF;">{</span>
    <span style="color: #F92672;">echo</span> <span style="color: #E6DB74;">"I don't like pasta"</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">this code is executed if $food is NEITHER "pasta" or "curry"</span>
<span style="color: #AE81FF;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org493b010" class="outline-3">
<h3 id="org493b010">While Loops</h3>
<div class="outline-text-3" id="text-org493b010">
<p>
A while loop will keep repeating while the condition is true:
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">cond</span> = <span style="color: #AE81FF;">true</span>;

<span style="color: #F92672;">while</span> <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">cond</span> == <span style="color: #AE81FF;">true</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
    <span style="color: #F92672;">echo</span> <span style="color: #E6DB74;">"This code will print over and over.&lt;br&gt;"</span>;
<span style="color: #AE81FF;">}</span>
</pre>
</div>
</div>
</div>
