php.org
** For Loops
A for loop has three parameters: some initial statement, a conditional statement which stops the loop if false, and a statement which run after every loop:

#+BEGIN_SRC php
for ($i = 0; $i < 10; $i++) {
    echo "i is " . $i; // this will print numbers from 0 to 9
}
#+END_SRC

** Arrays
   
To create an array variable in PHP, put the elements inside square brackets and separate them with commas:
   
#+BEGIN_SRC php
$weekDays = ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday"];
#+END_SRC

As PHP is a /dynamic/ language, you can mix different types in the same array:

#+BEGIN_SRC php
$mixedTypes = ["hello", 12, [132, "yes"], 28.22, "bye", true];
#+END_SRC

Use the array_push() function to add elements to an array. This changes the value of the array in-place (rather than returning the changed array):

#+BEGIN_SRC php
echo $weekDays; // ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday"]

array_push($weekDays, "Saturday", "Sunday"); // Note that this takes each new element as an extra argument

echo $weekDays; // ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"]
#+END_SRC

** Foreach loops
   
/Foreach/ loops are a very convenient way to go through each element of an array:

#+BEGIN_SRC php
// this prints each element of the $weekDays array
foreach ($weekDays as $w) {
  echo $w . "<br>";
}
#+END_SRC

Each time it goes through the loop, $w is given the value of an element from the array. So in this case, the first time round $w = "Monday", then $w = "Tuesday", then $w = "Wednesday", etc.

** Associative Arrays
 
Associative arrays (also called "Hash maps" or "Dictionaries" in other languages) hold sets of keys and values. A key is used to look up a value that is associated with it. For example:

#+BEGIN_SRC php
$person = ["name" => "Matt", "age" => 32, "height" => "186cm", "favourite_food" => "curry"];
#+END_SRC

The "fat arrow" (=>) goes between each key - value pair, so the template is:

#+BEGIN_SRC php
key => value
#+END_SRC

You can then use a key to look up its corresponding value:

#+BEGIN_SRC php
echo $person["name"] . " is awesome<br>";
echo "His favourite food is " . $person["favourite_food"] . ".<br>";
#+END_SRC

/Foreach/ loops can also be used to go through the items in an associative array:

#+BEGIN_SRC php
foreach ($person as $key => $value) {
  echo $key . " is " . $value;
}
#+END_SRC

The above goes through each item of the associative array and assigns its key to $key and the corresponding value to $value.


* Using Web Forms with PHP

*** GET vs POST requests
When you make an HTML form, you can specify the type of /request/ that is sent:

#+BEGIN_SRC html
<form action="script.php" method="post">
</form>
#+END_SRC

The two types of requests that you need to know about are /GET/ and /POST/ requests. GET requests are sent by adding information on to the end of a URL. For example, if you type "Matt" into a text box called "name" and "32" into another text box called "age", this will appear at the end of the URL:

#+BEGIN_SRC
?name=Matt&age=32
#+END_SRC

When this is sent to your /script.php/ file, the full URL in the bar appears as:

#+BEGIN_SRC
http://localhost/forms/script.php?name=Matt&age=32
#+END_SRC

But what if you have some valuable information that you don't want to be exposed in the URL of a page? You can imagine how this could be a security risk - you don't want to see a password you've entered into a web form to appear in the URL, for example. To solve this problem, you can use the /POST/ request, which sends the information invisibly.

So why use GET requests at all? Well, they can be useful in case you want to send or link to a URL with the certain parameters included. For example, if you have a web shop with a "products" page, and the product shown is dependent on parameters sent via GET, you could link to that product like this:

#+BEGIN_SRC
http://myfancyshop.com/products.php?productid=324
#+END_SRC

