php.html

<div id="outline-container-org5b6103a" class="outline-3">
<h3 id="org5b6103a">For Loops</h3>
<div class="outline-text-3" id="text-org5b6103a">
<p>
A for loop has three parameters: some initial statement, a conditional statement which stops the loop if false, and a statement which run after every loop:
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #F92672;">for</span> <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">i</span> = <span style="color: #AE81FF;">0</span>; <span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">i</span> &lt; <span style="color: #AE81FF;">10</span>; <span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">i</span>++<span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
    <span style="color: #F92672;">echo</span> <span style="color: #E6DB74;">"i is "</span> . <span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">i</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">this will print numbers from 0 to 9</span>
<span style="color: #AE81FF;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org292b95a" class="outline-3">
<h3 id="org292b95a">Arrays</h3>
<div class="outline-text-3" id="text-org292b95a">
<p>
To create an array variable in PHP, put the elements inside square brackets and separate them with commas:
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">weekDays</span> = <span style="color: #AE81FF;">[</span><span style="color: #E6DB74;">"Monday"</span>, <span style="color: #E6DB74;">"Tuesday"</span>, <span style="color: #E6DB74;">"Wednesday"</span>, <span style="color: #E6DB74;">"Thursday"</span>, <span style="color: #E6DB74;">"Friday"</span><span style="color: #AE81FF;">]</span>;
</pre>
</div>

<p>
As PHP is a <i>dynamic</i> language, you can mix different types in the same array:
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">mixedTypes</span> = <span style="color: #AE81FF;">[</span><span style="color: #E6DB74;">"hello"</span>, <span style="color: #AE81FF;">12</span>, <span style="color: #66D9EF;">[</span><span style="color: #AE81FF;">132</span>, <span style="color: #E6DB74;">"yes"</span><span style="color: #66D9EF;">]</span>, <span style="color: #AE81FF;">28.22</span>, <span style="color: #E6DB74;">"bye"</span>, <span style="color: #AE81FF;">true</span><span style="color: #AE81FF;">]</span>;
</pre>
</div>

<p>
Use the array<sub>push</sub>() function to add elements to an array. This changes the value of the array in-place (rather than returning the changed array):
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #F92672;">echo</span> <span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">weekDays</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">["Monday", "Tuesday", "Wednesday", "Thursday", "Friday"]</span>

array_push<span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">weekDays</span>, <span style="color: #E6DB74;">"Saturday"</span>, <span style="color: #E6DB74;">"Sunday"</span><span style="color: #AE81FF;">)</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">Note that this takes each new element as an extra argument</span>

<span style="color: #F92672;">echo</span> <span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">weekDays</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"]</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbf62cae" class="outline-3">
<h3 id="orgbf62cae">Foreach loops</h3>
<div class="outline-text-3" id="text-orgbf62cae">
<p>
<i>Foreach</i> loops are a very convenient way to go through each element of an array:
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #75715E;">// </span><span style="color: #75715E;">this prints each element of the $weekDays array</span>
<span style="color: #F92672;">foreach</span> <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">weekDays</span> <span style="color: #F92672;">as</span> <span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">w</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
  <span style="color: #F92672;">echo</span> <span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">w</span> . <span style="color: #E6DB74;">"&lt;br&gt;"</span>;
<span style="color: #AE81FF;">}</span>
</pre>
</div>

<p>
Each time it goes through the loop, $w is given the value of an element from the array. So in this case, the first time round $w = "Monday", then $w = "Tuesday", then $w = "Wednesday", etc.
</p>
</div>
</div>

<div id="outline-container-orgc490adb" class="outline-3">
<h3 id="orgc490adb">Associative Arrays</h3>
<div class="outline-text-3" id="text-orgc490adb">
<p>
Associative arrays (also called "Hash maps" or "Dictionaries" in other languages) hold sets of keys and values. A key is used to look up a value that is associated with it. For example:
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">person</span> = <span style="color: #AE81FF;">[</span><span style="color: #E6DB74;">"name"</span> =&gt; <span style="color: #E6DB74;">"Matt"</span>, <span style="color: #E6DB74;">"age"</span> =&gt; <span style="color: #AE81FF;">32</span>, <span style="color: #E6DB74;">"height"</span> =&gt; <span style="color: #E6DB74;">"186cm"</span>, <span style="color: #E6DB74;">"favourite_food"</span> =&gt; <span style="color: #E6DB74;">"curry"</span><span style="color: #AE81FF;">]</span>;
</pre>
</div>

<p>
The "fat arrow" (=&gt;) goes between each key - value pair, so the template is:
</p>

<div class="org-src-container">
<pre class="src src-php">key =&gt; value
</pre>
</div>

<p>
You can then use a key to look up its corresponding value:
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #F92672;">echo</span> <span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">person</span><span style="color: #AE81FF;">[</span><span style="color: #E6DB74;">"name"</span><span style="color: #AE81FF;">]</span> . <span style="color: #E6DB74;">" is awesome&lt;br&gt;"</span>;
<span style="color: #F92672;">echo</span> <span style="color: #E6DB74;">"His favourite food is "</span> . <span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">person</span><span style="color: #AE81FF;">[</span><span style="color: #E6DB74;">"favourite_food"</span><span style="color: #AE81FF;">]</span> . <span style="color: #E6DB74;">".&lt;br&gt;"</span>;
</pre>
</div>

<p>
<i>Foreach</i> loops can also be used to go through the items in an associative array:
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #F92672;">foreach</span> <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">person</span> <span style="color: #F92672;">as</span> <span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">key</span> =&gt; <span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">value</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
  <span style="color: #F92672;">echo</span> <span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">key</span> . <span style="color: #E6DB74;">" is "</span> . <span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">value</span>;
<span style="color: #AE81FF;">}</span>
</pre>
</div>

<p>
The above goes through each item of the associative array and assigns its key to $key and the corresponding value to $value.
</p>
</div>
</div>
</div>


<div id="outline-container-orgc02c485" class="outline-2">
<h2 id="orgc02c485">Using Web Forms with PHP</h2>
<div class="outline-text-2" id="text-orgc02c485">
</div>
<div id="outline-container-org46bb63e" class="outline-4">
<h4 id="org46bb63e">GET vs POST requests</h4>
<div class="outline-text-4" id="text-org46bb63e">
<p>
When you make an HTML form, you can specify the type of <i>request</i> that is sent:
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #A6E22E;">form</span> <span style="color: #FD971F;">action</span>=<span style="color: #E6DB74;">"script.php"</span> <span style="color: #FD971F;">method</span>=<span style="color: #E6DB74;">"post"</span>&gt;
&lt;/<span style="color: #A6E22E;">form</span>&gt;
</pre>
</div>

<p>
The two types of requests that you need to know about are <i>GET</i> and <i>POST</i> requests. GET requests are sent by adding information on to the end of a URL. For example, if you type "Matt" into a text box called "name" and "32" into another text box called "age", this will appear at the end of the URL:
</p>

<pre class="example">
?name=Matt&amp;age=32
</pre>

<p>
When this is sent to your <i>script.php</i> file, the full URL in the bar appears as:
</p>

<pre class="example">
http://localhost/forms/script.php?name=Matt&amp;age=32
</pre>

<p>
But what if you have some valuable information that you don't want to be exposed in the URL of a page? You can imagine how this could be a security risk - you don't want to see a password you've entered into a web form to appear in the URL, for example. To solve this problem, you can use the <i>POST</i> request, which sends the information invisibly.
</p>

<p>
So why use GET requests at all? Well, they can be useful in case you want to send or link to a URL with the certain parameters included. For example, if you have a web shop with a "products" page, and the product shown is dependent on parameters sent via GET, you could link to that product like this:
</p>

<pre class="example">
http://myfancyshop.com/products.php?productid=324
</pre>
</div>
</div>
