php.html

<div id="outline-container-orgb7fcb70" class="outline-4">
<h4 id="php_superglobals"><a id="orgb7fcb70"></a>PHP $<sub>GET</sub> and $<sub>POST</sub> superglobals</h4>
<div class="outline-text-4" id="text-php_superglobals">
<p>
Once you've sent the data to a PHP page using your web form, you need to access it using a <i>superglobal</i> variable. This changes according to the method you've used to send the data. If you used a <i>GET</i> request, you'd bind the form data to variables using <code>$_GET['']</code>:
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">username</span> = <span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">_GET</span><span style="color: #AE81FF;">[</span><span style="color: #E6DB74;">'username'</span><span style="color: #AE81FF;">]</span>;
<span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">height</span> = <span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">_GET</span><span style="color: #AE81FF;">[</span><span style="color: #E6DB74;">'height'</span><span style="color: #AE81FF;">]</span>;
<span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">birthday</span> = <span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">_GET</span><span style="color: #AE81FF;">[</span><span style="color: #E6DB74;">'birthday'</span><span style="color: #AE81FF;">]</span>;
</pre>
</div>

<p>
If you've used a <i>POST</i> request instead, you can access the data with <code>$_POST['']</code>:
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">username</span> = <span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">_GET</span><span style="color: #AE81FF;">[</span><span style="color: #E6DB74;">'username'</span><span style="color: #AE81FF;">]</span>;
<span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">height</span> = <span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">_GET</span><span style="color: #AE81FF;">[</span><span style="color: #E6DB74;">'height'</span><span style="color: #AE81FF;">]</span>;
<span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">birthday</span> = <span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">_GET</span><span style="color: #AE81FF;">[</span><span style="color: #E6DB74;">'birthday'</span><span style="color: #AE81FF;">]</span>;
</pre>
</div>

<p>
You can then use the form information using the variables you've declared.
</p>
</div>
</div>
</div>

<div id="outline-container-org8fa7ef4" class="outline-2">
<h2 id="org8fa7ef4">Accessing MySQL Databases with PHP</h2>
<div class="outline-text-2" id="text-org8fa7ef4">
<p>
This session covers:
</p>

<p>
We will use the <a href="http://php.net/manual/en/book.mysqli.php">mysqli interface</a> to connect to MySQL database from PHP code. The mysqli interface has two different ways of using it: the <i>object-oriented</i> way and the <i>procedural</i> way. We will be using the procedural API throughout this course.
</p>
</div>

<div id="outline-container-org7c5c2de" class="outline-3">
<h3 id="php_mysql"><a id="org7c5c2de"></a>Connecting to a MySQL database with PHP</h3>
<div class="outline-text-3" id="text-php_mysql">
<p>
First, you need to create a file called <code>index.php</code> somewhere on your web server. For example, if you put it in a folder called "mysql" inside XAMPP's htdocs folder, it will be accessible at this address: <a href="http://localhost/mysql">http://localhost/mysql</a>. Put the usual skeleton of an HTML file inside:
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #AE81FF;">&lt;</span>html<span style="color: #AE81FF;">&gt;</span>
<span style="color: #AE81FF;">&lt;</span>head<span style="color: #AE81FF;">&gt;&lt;</span>title<span style="color: #AE81FF;">&gt;</span><span style="color: #AE81FF;">PHP</span> <span style="color: #F92672;">and</span> MySQL&lt;/title&gt;&lt;/head&gt;
    <span style="color: #AE81FF;">&lt;</span>body<span style="color: #AE81FF;">&gt;</span>

<span style="color: #F92672;">        &lt;?php</span>

        <span style="color: #75715E;">// </span><span style="color: #75715E;">Your PHP code goes here</span>

        <span style="color: #AE81FF;">?&gt;</span>

    &lt;/body&gt;
&lt;/html&gt;
</pre>
</div>

<p>
The next step is to create some variables to hold the login details for the MySQL database:
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">host</span> = <span style="color: #E6DB74;">"localhost"</span>;
<span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">username</span> = <span style="color: #E6DB74;">"matty"</span>;
<span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">password</span> = <span style="color: #E6DB74;">"password"</span>;
<span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">db</span> = <span style="color: #E6DB74;">"mydatabase"</span>;
</pre>
</div>

<p>
We will refer to these variables when we create the database connection. This is done by using the <code>mysqli_connect()</code> function:
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">connection</span> = mysqli_connect<span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">host</span>, <span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">username</span>, <span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">password</span>, <span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">db</span><span style="color: #AE81FF;">)</span>;
</pre>
</div>

<p>
When we call the <code>mysqli_connect</code> function, the result is stored in the <code>$connection</code> variable. This is used to store the state of the connection to the database, so that we can use it to query, make changes and close the connection when we are done.
</p>

<p>
To check that the connection succeeded, use an <i>if</i>-statement:
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #F92672;">if</span><span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">connection</span> === <span style="color: #AE81FF;">false</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
    <span style="color: #F92672;">die</span><span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">"ERROR: Could not connect."</span> . mysqli_connect_error<span style="color: #A6E22E;">()</span><span style="color: #66D9EF;">)</span>;
<span style="color: #AE81FF;">}</span>

<span style="color: #F92672;">echo</span> <span style="color: #E6DB74;">"Connection successful"</span>;
</pre>
</div>

<p>
This checks to see if the connection was successful, then terminates the PHP script with an error message if not. If it did succeed, it prints "Connection successful".
</p>

<p>
The full, complete code for connecting to the database is listed in <a href="code/1_connection.php">this file</a>.
</p>
</div>
</div>

<div id="outline-container-org3586c8e" class="outline-3">
<h3 id="org3586c8e">Querying the database with PHP</h3>
<div class="outline-text-3" id="text-org3586c8e">
<p>
Now that we have connected to our database using PHP, we can send some SQL queries to it. In this example, we're going to get all of the entries from a table called "users", then go through the results row by row, printing only the values in the "name" column.
</p>

<p>
First, we'll create a string for our SQL query and assign it to a variable called <code>$sql</code>:
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #F8F8F2; background-color: #000000;">$</span><span style="color: #FD971F;">sql</span> = <span style="color: #E6DB74;">"SELECT * FROM suspect;"</span>;
</pre>
</div>

<p>
The full code for querying the database is in <a href="code/2_send_sql_query.php">this file</a>.
</p>
</div>
</div>

<div id="outline-container-org1a1cf15" class="outline-3">
<h3 id="org1a1cf15">Creating a new database</h3>
<div class="outline-text-3" id="text-org1a1cf15">
<p>
The full code for creating a new database is in <a href="code/3_create_database.php">this file</a>.
</p>
</div>
</div>

<div id="outline-container-org1badac2" class="outline-3">
<h3 id="org1badac2">Creating a new table</h3>
<div class="outline-text-3" id="text-org1badac2">
<p>
The full code for creating a table inside a database is <a href="code/4_create_table.php">here</a>.
</p>
</div>
</div>

<div id="outline-container-org705dacd" class="outline-3">
<h3 id="org705dacd">Using a HTML form to add rows to a database</h3>
<div class="outline-text-3" id="text-org705dacd">
<p>
The code for the HTML form page is <a href="code/5a_form.php">here</a>.
The PHP code for handling the GET request is <a href="code/5b_insert.php">here</a>.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
